# Напишите программу генерирующую и записывающую в файле произвольное 20000-значное целое число.
import random

num = random.randint(-10**20000, 10**20000)

print(num)
